[
  {
    "code": "50",
    "priority": "MED",
    "meaning": "Measured blood temperature > 41°C",
    "causes": "Ambient temperature t oo high Blood gas analyzer not operational Water not circulating through heater and oxygenator",
    "actions": "Remove OrganOx metra cover and/or move device to a cooler environment IMMEDIATELY. Check that blood gas analyzer (BGA) is in 'Operate' mode and that data displayed on BGA matches data on the OrganOx metra GUI. If not, power the OrganOx metra down and restart as per IFU. Contact your Clinical Specialist if problem persists. Check that both water connections to oxygenator are fully engaged and have no kinks. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "60*",
    "priority": "MED",
    "meaning": "Measured blood temperature > 41°C for more than 10 minutes",
    "causes": "Blood gas analyzer temperature sensor or water heater malfunction.",
    "actions": "Stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ."
  },
  {
    "code": "80*†",
    "priority": "MED",
    "meaning": "Low battery",
    "causes": "No external power source Battery nearing end-of- life.",
    "actions": "Connect to an external power source. Note that temperature control and oxygenation will be automatically shut down once alarm sounds. Ensure battery is fully charged before device used again. Contact your Clinical Specialist if rapid discharge problem persists."
  },
  {
    "code": "90*†",
    "priority": "MED",
    "meaning": "Empty battery – system has stopped",
    "causes": "Battery empty. No external power source.",
    "actions": "URGENTLY connect to an external power source and re-start the perfusion or re- start the device as necessary. If no power source available, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ."
  },
  {
    "code": "100",
    "priority": "LOW",
    "meaning": "Glucose update required",
    "causes": "No glucose value has been entered for 4 hours or more",
    "actions": "Measure blood glucose and enter value."
  },
  {
    "code": "110",
    "priority": "LOW",
    "meaning": "Less than 2 hours of perfusion remaining.",
    "causes": "Perfusion has exceeded 22 hours with a maximum allowed period of 24 hours.",
    "actions": "Remove liver from device as per IFU by 24 hours."
  },
  {
    "code": "120",
    "priority": "LOW",
    "meaning": "Temperature within electronics enclosure > 60°C",
    "causes": "Excessive heat production or reduced heat dissipation within device.",
    "actions": "Ensure blood temperature remains physiological. Remove outer hardcover and/or move device to cooler environment. If problem persists contact your Clinical Specialist"
  },
  {
    "code": "130",
    "priority": "MED",
    "meaning": "Temperature within electronics enclosure is > 70°C – system has stopped",
    "causes": "Excessive heat production or reduced heat dissipation within device.",
    "actions": "Ensure blood temperature remains physiological. URGENTLY remove outer hardcover and/or move device to cooler environment. Re-start the perfusion or re-start the device as necessary. If problem persists contact your Clinical Specialist."
  },
  {
    "code": "140*†",
    "priority": "MED",
    "meaning": "No IVC pressure detected",
    "causes": "IVC pressure sensor is not connected IVC pressure sensor is faulty",
    "actions": "Check that IVC pressure sensor is connected. Disconnect and reconnect IVC sensor according to IFU. If liver not connected, replace disposable set (do not attempt to replace sensor). If liver connected, stop perfusion and remove liver from device using cold perfusion. If problem persists with diﬀerent disposable set, contact your Clinical Specialist."
  },
  {
    "code": "150*†",
    "priority": "MED",
    "meaning": "No Arterial pressure detected",
    "causes": "Arterial pressure sensor is not connected Arterial pressure sensor is faulty",
    "actions": "Check that arterial pressure sensor is connected. Disconnect and reconnect IVC sensor according to IFU. If liver not connected, replace disposable set (do not attempt to replace sensor). If liver connected, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. If problem persists with diﬀerent disposable set, contact your Clinical Specialist."
  },
  {
    "code": "170*†",
    "priority": "MED",
    "meaning": "No blood temperature measurement detected",
    "causes": "Blood gas analyzer not operational Blood gas analysis sensor is faulty",
    "actions": "Check that blood gas analyzer (BGA) is in 'Operate' mode and that data displayed on BGA matches data on the OrganOx metra GUI. If not, power the OrganOx metra down and restart as per IFU. Contact your Clinical Specialist if problem persists. If problem persists, stop perfusion and remove liver from device using cold perfusion It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist."
  },
  {
    "code": "180*‡",
    "priority": "LOW",
    "meaning": "interface board (IFB) timeout / no replies / IFB cyclic redundancy check (CRC) error",
    "causes": "Hardware fault",
    "actions": "Fault will normally self-resolve. Check the following on the OrganOx metra GUI over a period of 5 minutes to ensure that it has: 1) Temperature is controlled to >36C; 2) pO and pCO values remain 2 2 within the normal range indicated; 3) Centrifugal pump target RPM and actual RPM are within 100 RPM and IVC ﬂow is non-zero. If this is not the case, power down and restart the OrganOx metra as per IFU. If error still persists with liver on board, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist"
  },
  {
    "code": "190*‡",
    "priority": "MED",
    "meaning": "Terumo timeout / no replies Terumo CRC error",
    "causes": "Blood gas analyzer not operational Hardware fault",
    "actions": "Check that blood gas analyzer (BGA) is in 'Operate' mode and that data displayed on BGA matches data on the OrganOx metra GUI. If not, power the OrganOx metra down and restart as per IFU. Contact your Clinical Specialist if problem persists. Attempt to power down and restart the OrganOx metra as per IFU. If problem persists, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist."
  },
  {
    "code": "200*‡",
    "priority": "MED",
    "meaning": "Centrifugal Pump Error",
    "causes": "Hardware fault",
    "actions": "Attempt to power down and restart the OrganOx metra as per IFU. If problem persists, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist."
  },
  {
    "code": "210*‡",
    "priority": "MED",
    "meaning": "Air compressor error",
    "causes": "Hardware fault",
    "actions": "Attempt to power down and restart the metra as per IFU. If problem persists, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist."
  },
  {
    "code": "220*‡",
    "priority": "MED",
    "meaning": "Upper proportional pinch valve error",
    "causes": "Hardware fault",
    "actions": "Attempt to power down and restart the OrganOx metra as per IFU. If problem persists, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist."
  },
  {
    "code": "230*‡",
    "priority": "MED",
    "meaning": "Lower proportional pinch valve error",
    "causes": "Hardware fault",
    "actions": "Attempt to power down and restart the OrganOx metra. If problem persists, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist."
  },
  {
    "code": "240‡",
    "priority": "MED",
    "meaning": "Portal ﬂow sensor error: system cannot detect air bubbles",
    "causes": "Hardware fault",
    "actions": "Attempt to power down and restart the OrganOx metra. If problem persists, stop perfusion and remove liver from device using cold perfusion. Contact your Clinical Specialist. It is the surgeon’s discretion whether to transplant this organ."
  },
  {
    "code": "250‡",
    "priority": "MED",
    "meaning": "IVC ﬂow sensor error",
    "causes": "Hardware fault",
    "actions": "Attempt to power down and restart the OrganOx metra. If problem persists, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist."
  },
  {
    "code": "260",
    "priority": "MED",
    "meaning": "Battery monitor error - no battery level available",
    "causes": "Hardware fault",
    "actions": "Urgently connect device to an external power supply (note - no warning will be given of empty battery). Contact your Clinical Specialist."
  },
  {
    "code": "270",
    "priority": "MED",
    "meaning": "Syringes need replacement",
    "causes": "Occluded tubing",
    "actions": "Check all four syringe lines for occlusions. If problem persists, contact your Clinical Specialist."
  },
  {
    "code": "280",
    "priority": "MED",
    "meaning": "High water temperature",
    "causes": "Water not circulating through heater and oxygenator Blood gas analyzer providing erroneous blood temperature information. Ambient temperature too high",
    "actions": "Check that both water inlet and outlet connects to oxygenator are fully engaged and have no kinks. Contact your Clinical Specialist if problem persists. Check installation of blood gas analyzer (BGA) sensor. Check that BGA is in 'Operate' mode and that data displayed on BGA matches data on the OrganOx metra GUI. If not, power the OrganOx metra down and restart as per IFU. Contact your Clinical Specialist if problem persists. Move device to a cooler environment."
  },
  {
    "code": "290†",
    "priority": "MED",
    "meaning": "Low water reservoir",
    "causes": "Not enough water in reservoir System tilted to expose level sensor Possible leak in water circulation system",
    "actions": "Check and re-ﬁll water reservoir Level the system as soon as practicable Check for leaks and re-ﬁll water reservoir as necessary. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "300",
    "priority": "LOW",
    "meaning": "Ascites pump running continuously",
    "causes": "Excessive ﬂuid leakage from liver Malfunction of ascites recirculation system.",
    "actions": "Check surgical integrity of liver and take necessary action. Check ascites level sensorCorrect ﬁtting of ascites recirculation line through pump. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "310",
    "priority": "MED",
    "meaning": "Ascites pump never running",
    "causes": "Malfunction of ascites recirculation system. Hardware fault",
    "actions": "Check whether ﬂuid has accumulated in liver bowl, and if so check ascites level sensor. Contact your Clinical Specialist if problem persists. Contact your Clinical Specialist."
  },
  {
    "code": "320",
    "priority": "MED",
    "meaning": "No water temperature measurement detected",
    "causes": "Hardware fault",
    "actions": "Attempt to power down and restart the OrganOx metra. Check that blood temperature remains physiological. If not, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist."
  },
  {
    "code": "330*",
    "priority": "MED",
    "meaning": "Frequently empty blood reservoir",
    "causes": "Excessive ﬂuid in liver bowl",
    "actions": "Check surgical integrity of liver and take necessary action. Check that IVC drainage is occurring and reposition cannula if necessary. Check functioning of ascites recirculation system. If issue persists, add human albumin to replenish reservoir."
  },
  {
    "code": "340†",
    "priority": "MED",
    "meaning": "Clinimix® pump error",
    "causes": "Hardware fault",
    "actions": "Attempt to power down and restart the OrganOx metra. If problem persists and liver already on board, deliver nutrition manually as per the IFU. Contact your Clinical Specialist."
  },
  {
    "code": "350†",
    "priority": "MED",
    "meaning": "Bile pinch valve error",
    "causes": "Hardware fault",
    "actions": "Attempt to power down and restart the OrganOx metra. If problem persists and liver already on board, remove bile tubing from bile pinch valve - bile will now drain freely into bile collection compartment and bile production will no longer be automatically measured. Contact your Clinical Specialist."
  },
  {
    "code": "360",
    "priority": "MED",
    "meaning": "Excessive blood/water temperature diﬀerence.",
    "causes": "Blood gas analyzer providing erroneous blood temperature information. Or the Terumo sensor is not fully engaged.",
    "actions": "Check installation of blood gas analyzer (BGA) sensor. Check that the Terumo sensor is correctly ﬁtted and is clicked into place. Check that BGA is in 'Operate' mode and that data displayed on BGA matches data on the OrganOx metra GUI. If not, power the OrganOx metra down and restart as per IFU. If the problem persists remove the liver using the rapid retrieval technique and contact your Clinical Specialist if problem persists."
  },
  {
    "code": "370",
    "priority": "MED",
    "meaning": "Low portal vein ﬂow",
    "causes": "Portal tubing kinked, Roberts clamp not open, or poor cannula placement. Empty reservoir Lower pinch valve malfunction",
    "actions": "Re-wet portal ﬂow sensor. Ensure Roberts clamp on portal line within liver bowl is fully open and check portal line for kinks. If issue persists, reposition liver and portal cannula. Check whether ﬂuid has accumulated in liver bowl, and if so check ascites level sensor and pump. Add human albumin solution to replenish reservoir if appropriate. Contact your Clinical Specialist if problem persists. Press 'Stop Perfusion', then 'Remove Cartridge' twice to fully open pinch valve, then ‘Start Perfusion'. If problem persists, power down and restart the OrganOx metra as per IFU. If problem still persists with liver on board, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist"
  },
  {
    "code": "380",
    "priority": "MED",
    "meaning": "Low IVC ﬂow",
    "causes": "IVC tubing kinked, Roberts clamp not open, or poor cannula placement.",
    "actions": "Ensure Roberts clamp on IVC line within liver bowl is fully open and check IVC line for kinks. If issue persists, reposition liver and IVC cannula."
  },
  {
    "code": "390",
    "priority": "MED",
    "meaning": "Low hepatic artery ﬂow",
    "causes": "Arterial tubing kinked, Roberts clamp not open, or poor cannula placement. Upper pinch valve malfunction Hardware fault",
    "actions": "Ensure Roberts clamp on arterial line within liver bowl is fully open and check arterial line for kinks. If issue persists, reposition liver and arterial cannula. Press 'Stop Perfusion', then 'Remove Cartridge' twice to fully open pinch valve, then 'Start Perfusion'. If problem persists, power down and restart the OrganOx metra as per IFU. If problem persists with liver on board, stop perfusion and remove liver using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Press 'Stop Perfusion', then 'Start Perfusion'. If problem persists, power down and restart the OrganOx metra as per IFU. If problem still persists with liver on board, stop perfusion and remove liver using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist."
  },
  {
    "code": "400",
    "priority": "MED",
    "meaning": "Low blood temperature",
    "causes": "Water not circulating through heater and oxygenator",
    "actions": "Check that both water inlet and outlet connections to the oxygenator are fully engaged and have no kinks. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "410*",
    "priority": "MED",
    "meaning": "Low blood oxygen levels",
    "causes": "Oxygenator gas port not connected Blood not circulating through blood gas analyzer bypass line Hardware fault",
    "actions": "Check that gas line into oxygenator is fully engaged and has no kinks. Contact your Clinical Specialist if problem persists. Check that the Roberts clamps on the blood gas analyzer bypass line are fully open, that the Terumo sensor is connected and that there are no kinks or obstructions on the line. Attempt to power down and restart the OrganOx metra. If problem persists, stop perfusion and remove liver from device using cold perfusion. It is the surgeon’s discretion whether to transplant this organ. Contact your Clinical Specialist."
  },
  {
    "code": "430",
    "priority": "MED",
    "meaning": "Unable to determine power source",
    "causes": "Hardware fault",
    "actions": "Urgently connect device to an external power supply (note - no warning will be given of empty battery). Contact your Clinical Specialist."
  },
  {
    "code": "450",
    "priority": "LOW",
    "meaning": "Measured blood temperature > 38°C",
    "causes": "Ambient temperature t oo high Blood gas analyzer not operational",
    "actions": "Remove the OrganOx metra cover and/or move device to a cooler environment as soon as possible. Check that blood gas analyzer (BGA) is in 'Operate' mode and that data displayed on BGA matches data on the OrganOx metra GUI. If not, power the OrganOx metra down and restart as per IFU. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "460",
    "priority": "LOW",
    "meaning": "Measured tower temperature < 5°C",
    "causes": "Ambient temperature too low",
    "actions": "Move device to a warmer environment as soon as possible. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "470",
    "priority": "LOW",
    "meaning": "Oxygen Concentrator Failure",
    "causes": "Hardware fault",
    "actions": "Stop perfusion and attempt to power down and restart the OrganOx metra. If problem persists, stop perfusion and remove liver from device using cold perfusion. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "480",
    "priority": "LOW",
    "meaning": "High blood oxygen levels measured continuously for more than 3 minutes",
    "causes": "Blood not circulating through BGA bypass line",
    "actions": "Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "490",
    "priority": "LOW",
    "meaning": "High blood carbon dioxide levels measured continuously for more than 3 minutes",
    "causes": "No gas ﬂow into oxygenator",
    "actions": "Check that the oxygenator gas inlet Colder Products Company (CPC) connector is fully engaged into the male panel mount CPC connector just above the portal ﬂow sensor. Check that the BGA sensor is correctly ﬁtted and is clicked in place. Check that the Roberts clamps on the BGA bypass line are fully open. Check that BGA is in ‘Operate’ mode and that data displayed on BGA matches data on the OrganOx metra GUI. Attempt to power down and restart the OrganOx metra. If problem persists, stop perfusion and remove liver from device using cold perfusion. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "500",
    "priority": "LOW",
    "meaning": "Low blood carbon dioxide levels measured continuously for more than 3 minutes",
    "causes": "Blood not circulating through BGA bypass line BGA not operational Hardware fault",
    "actions": "Check that the Roberts clamps on the BGA bypass line are fully open, that the Terumo sensor is connected and that there are no kinks or obstructions on the line. Check that the BGA sensor is correctly ﬁtted and is clicked in place. Check that BGA is in ‘Operate’ mode and that data displayed on BGA matches data on the OrganOx metra GUI. If not, power the OrganOx metra down and restart as per IFU. If problem persists, stop perfusion and remove liver from device using cold perfusion. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "510",
    "priority": "LOW",
    "meaning": "Arterial blood pressure in excess of 100 mmHg for more than 3 minutes",
    "causes": "Arterial tubing kinked, Roberts clamp not open, or poor cannula placement Upper pinch valve malfunction Hardware fault",
    "actions": "Press ‘Stop Perfusion’ and then ‘Start Perfusion’. If problem persists, power down and restart the OrganOx metra as per IFU. If problem persists, stop perfusion and remove liver from device using cold perfusion. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "520",
    "priority": "LOW",
    "meaning": "Power Board Fault",
    "causes": "Hardware fault",
    "actions": "Attempt to power down and restart the OrganOx metra. If problem persists, stop perfusion and remove liver from device using cold perfusion, it is at the discretion of the transplanting surgeon if this organ is transplanted. Contact your Clinical Specialist if problem persists."
  },
  {
    "code": "10xx*",
    "priority": "LOW",
    "meaning": "Internal software fault",
    "causes": "An unexpected software condition has occurred",
    "actions": "Re-start system (stop, switch oﬀ and on, start). Report failure to OrganOx, and provide log ﬁles for analysis"
  },
  {
    "code": "2060",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "Measured blood temperature exceeded 41°C for more than 10 minutes at some point during the perfusion",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2080",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "Low battery potentially led to temperature control and oxygenation being shut down",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2090",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "Empty battery led to system stopping",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2140",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "No IVC pressure measurement was detected for more than 10s at some point during the perfusion",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2150",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "No arterial pressure measurement was detected for more than 10s at some point during the perfusion",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2170",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "No blood temperature measurement was detected for more than 10s at some point during the perfusion.",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2180",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "An Interface Board (IFB) error occurred for more than 5s at some point during the perfusion.",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2190",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "No measurements could be retrieved from the Terumo blood gas analyzer for more than 5s at some point during the perfusion",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2200",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "A Centrifugal pump error occurred at some point during the perfusion",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2210",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "An air compressor error occurred at some point during the perfusion",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2220",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "An upper proportional pinch valve error occurred at some point during the perfusion",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2230",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "A lower proportional pinch valve error occurred at some point during the perfusion",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2330",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "The reservoir was frequently empty over the course of 30 minutes or more at some point during the perfusion",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  },
  {
    "code": "2410",
    "priority": "LOW",
    "meaning": "Critical fault reported",
    "causes": "Low blood oxygen levels were measured continuously for several minutes at some point during the perfusion.",
    "actions": "Refer to 'Plot Data Logs' tab for detailed perfusion history."
  }
]